{
  "games": [
    {
      "title": "Guardians of the Galaxy",
      "gameId": "guardians_of_the_galaxy",
      "platforms": "Playstation 4",
      "cover": "/gotg.jpg",
      "rating": 5,
      "bg": "/bg_gotg.png",
      "desc1": "The plot of Marvel's Guardians of the Galaxy takes place several years after a massive interstellar war that raged across the universe.",
      "desc2": "Among those looking to survive in the Andromeda galaxy are the newly 'heroes for hire', the Guardians of the Galaxy, who all hope to make quick money during their adventurous wanderings around the galaxy. However, while attempting to capture a beast for a wealthy collector, a seemingly harmless bet between two team members inadvertently sets in motion a series of catastrophic events that threaten the peace of the fragile universe unless the team takes responsibility for their actions and eradicates the threat.",
      "trailer": "https://www.youtube.com/embed/3PnAnIT4f68"
    },
    {
      "title": "Spider-Man: Miles Morales",
      "gameId": "spiderman_miles_morales",
      "platforms": "Playstation 5",
      "cover": "/spm.jpg",
      "rating": 4,
      "bg": "/bg_profile.png",
      "desc1": "The story picks up about a year after the events of The City That Never Sleeps. Miles Morales, having gained spider-like powers himself at the end of Marvel's Spider-Man, looks to become the newest web-slinger of New York City under the guidance of his mentor, Peter Parker.",
      "desc2": "A year later after his training with Peter is complete, Miles has fully integrated himself into the black and red suit as an experienced Spider-Man while defending both his new home in Harlem and the rest of New York City from a gang war between the energy corporation, Roxxon and a criminal army, known as the Underground, lead by the Tinkerer. Parker tells Miles that he has to be like his late father and walk on the path to becoming a hero for the city of New York.",
      "trailer": "https://www.youtube.com/embed/oZXyrAfuHOo"
    },
    {
      "title": "Ratchet & Clank",
      "gameId": "ratchet_clank",
      "platforms": "Playstation 5",
      "cover": "/rec.jpg",
      "rating": 3,
      "bg": "/bg_rec.png",
      "desc1": "Ratchet and Clank recover the Dimensional Map but are ambushed by Emperor Nefarious and banished through a rift. Kit transforms into her Warbot form to try and stop Emperor Nefarious, shocking Rivet, but Kit ends up being banished through a rift as well.",
      "desc2": "Left alone, Rivet heads for the prison facility Emperor Nefarious has banished all of his enemies to and stages a prison break, freeing Ratchet and Clank as well as the rest of the Resistance. However, still feeling guilty over causing the loss of Rivet's arm, Kit decides to leave the group. As the Resistance regroups, Emperor Nefarious announces that he plans to start invading other dimensions, starting with Ratchet and Clank's home dimension. Ratchet, Clank, Rivet, and the Resistance pursue Emperor Nefarious through the rift. Ratchet and Clank destroy Emperor Nefarious' giant power suit, and Kit returns to hold his forces at bay while Rivet confronts Emperor Nefarious personally. Working together, everybody, including Dr. Nefarious, manage to defeat and banish Emperor Nefarious through a rift. Clank recovers the Dimensionator and uses it to repair the dimensions, averting the Dimensional Cataclysm.",
      "trailer": "https://www.youtube.com/embed/55PRv_e00wc"
    },
    {
      "title": "Spider-Man",
      "gameId": "spider-man",
      "platforms": "Playstation 4",
      "cover": "/sp.jpg",
      "rating": 4,
      "bg": "/bg_sp.png",
      "desc1": "Peter Parker is a 23-year-old research assistant, who gains superhuman abilities after being bitten by a genetically-modified spider. Assuming a secret identity as the superhero Spider-Man, Peter uses these abilities to protect the residents of New York City",
      "desc2": "Eight years into his superhero career, Peter has become an experienced crime fighter but struggles to balance his superhero and personal lives. Peter is assisted by Daily Bugle reporter Mary Jane Watson, his ex-girlfriend, and NYPD captain Yuri Watanabe. In his civilian life, Peter is supported by his Aunt May who volunteers at the F.E.A.S.T. homeless shelter run by philanthropist Martin Li. Peter is employed by his friend and mentor, the respected scientist Dr. Otto Octavius.",
      "trailer": "https://www.youtube.com/embed/q4GdJVvdxss"
    },
    {
      "title": "Horizon Forbiden West",
      "gameId": "horizon_forbiden_west",
      "platforms": "Playstation 4",
      "cover": "/hfw.jpg",
      "rating": 3,
      "bg": "/bg_hfw.png",
      "desc1": "Horizon Forbidden West continues the story of Aloy (Ashly Burch), a young hunter of the Nora tribe and a clone of the Old World scientist Elisabet Sobeck, as she leads a band of companions on a quest to the arcane frontier known as the Forbidden West to find the source of a mysterious plague that kills all it infects.",
      "desc2": "On her journey across these uncharted lands, Aloy encounters new regions ravaged by massive storms and deadly machines, and conflicts with a tribe of nomadic raiders who have tamed the machines as war mounts. She discovers a vast array of environments and ecosystems, including lush valleys, dry deserts, snowy mountains, tropical beaches, ruined cities, and underwater settings.",
      "trailer": "https://www.youtube.com/embed/Lq594XmpPBg"
    },
    {
      "title": "Kirby",
      "gameId": "kirby",
      "platforms": "Switch",
      "cover": "/kirby.jpg",
      "rating": 4,
      "bg": "/bg_kirby.png",
      "desc1": "Kirby and the Forgotten Land is the first platform game in the series with full 3D gameplay, where the player must guide Kirby through various different stages to save the Waddle Dees at the end. As in most Kirby games, Kirby can jump and slide as well as inhale enemies and objects which he can either spit out like projectiles or swallow to gain a copy ability.",
      "desc2": "Alongside returning copy abilities, this game introduced two new copy abilities in the form of Drill and Ranger, as well as an upgrade system for copy abilities and a new 'Mouthful Mode' where Kirby can swallow and control larger objects, such as cars and vending machines. Similar to Kirby Battle Royale and Kirby and the Rainbow Curse, a second player can join in and play as Bandana Waddle Dee, who uses a spear as his main form of attack. The goal of each stage is to rescue the Waddle Dees, who are freed by finding them trapped in cages, as well as by accomplishing certain goals specific to each stage. Once rescued, they are returned to Waddle Dee Town, the main hub of the game. As the player rescues more Waddle Dees, the town size increases as well as unlocks minigames that the player can compete with others online for the top score. The game also supports amiibo functionality.",
      "trailer": "https://www.youtube.com/embed/H3LAkr0ANgw"
    },
    {
      "title": "Nintendo Switch Sports",
      "gameId": "nintendo_switch_sports",
      "platforms": "Switch",
      "cover": "/nss.jpg",
      "rating": 3,
      "bg": "/bg_nss.png",
      "desc1": "Nintendo Switch Sports is set in a fictional multi-sport facility named Spocco Square, which contains three sports from previous installments (tennis and bowling from Wii Sports and swordplay from Wii Sports Resort; known as chambara within the game), and three new sports (association football, volleyball, and badminton).",
      "desc2": "Another sport from a previous installment, golf, was announced as well, and will be issued in a free update sometime in late 2022. Players utilize the Nintendo Switch's Joy-Con in a similar manner to the other Wii Sports games, positioning them in a manner resembling the actual sport. The gyroscope functionality embedded within the Joy-Con are used to simulate motion in-game, compared to the usage of the Wii Remote (and occasionally the Nunchuk) to simulate motion in the other games in the series.",
      "trailer": "https://www.youtube.com/embed/TZ16-1YIRAc"
    },
    {
      "title": "Crash Bandicoot 4",
      "gameId": "crash_bandicoot_4",
      "platforms": "Switch",
      "cover": "/cb4.jpg",
      "rating": 3,
      "bg": "/bg_cb4.png",
      "desc1": "Following their defeat at the hands of Crash Bandicoot in Crash Bandicoot: Warped, Uka Uka attempts to liberate himself and Doctors Neo Cortex and Nefarious Tropy from their prison in the past. His latest effort rips open a hole in the fabric of space and time, and causes him to pass out.",
      "desc2": "Cortex and N. Tropy swiftly escape, abandoning Uka Uka, and discover that the rift they use links their universe to the rest of the multiverse, and decide to make use of it to conquer all dimensions. To ensure success, the pair create a generator capable of opening other space-time rifts and recruit aid from Doctors N. Lani spots a rift and suspects there is trouble, leading to Crash and his sister Coco agreeing to follow him across the multiverse and find the other Quantum Masks, while combating the chaos Cortex is creating.",
      "trailer": "https://www.youtube.com/embed/aOGwx3Ju6QQ"
    }
  ],
  "bigames": [
    {
      "title": "Star Wars",
      "gameId": "star_wars",
      "cover": "/sw.jpg"
    },
    {
      "title": "Chrono",
      "gameId": "chrono",
      "cover": "/chrono.jpg"
    },
    {
      "title": "Salt",
      "gameId": "salt",
      "cover": "/salt.jpg"
    }
  ]
}
